;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! doom-snippets :disable t)
(package! lsp-python-ms :disable t)
(package! eshell :disable t)
(package! treemacs :disable t)
(package! lsp-treemacs :disable t)

(package! benchmark-init)
(package! company-quickhelp)
(package! undo-tree)
(package! imenu-list)

; (package! blacken)

;; For personal modeline
(package! anzu)
(package! evil-anzu)

;; flyckeck for back and python
(package! flycheck-pycheckers)
(package! flycheck-checkbashisms)


;; (package! lsp-java)
;; (package! move-text)
;; (package! sql-indent)
;; (package! deadgrep)
;; (package! jupyter)
;; (package! org-super-agenda)
;; (package! ivy-postframe)
;; (package! emms)
