;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! doom-snippets :disable t)
(package! lsp-python-ms :disable t)


(package! benchmark-init)
(package! yasnippet-snippets)
(package! company-quickhelp)
(package! undo-tree)
(package! imenu-list)

; (package! blacken)

;; For personal modeline
(package! anzu)
(package! evil-anzu)

;; flyckeck for back and python
(package! flycheck-pycheckers)
(package! flycheck-checkbashisms)


;; (package! ggtags)
;; (package! lsp-java)
;; (package! move-text)
;; (package! sql-indent)
;; (package! deadgrep)
;; (package! jupyter)
;; (package! py-isort)
;; (package! company-jedi)
;; (package! org-super-agenda)
;; (package! company-english-helper)
;; (package! importmagic)
;; (package! ivy-postframe)
;; (package! all-the-icons-ivy)
;; (package! emms)
